1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.

In [1]:
import pandas as pd

(1-01) 데이터를 저장해 주세요.

In [2]:
data = {'이름' : ['메로나', '비비빅', '죠스바'],
        '가격' : [300, 400, 250],
        '재고' : [20, 3, 100]}

In [3]:
df = pd.DataFrame(data)
df

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

(1-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.

In [4]:
# 주요 속성 6개
print(f'index   : {df.index}')
print(f'columns : {df.columns}')
print(f'values : {df.values}')
print(f'dtypes : {df.dtypes}')
print(f'ndim : {df.ndim}')
print(f'shape : {df.shape}')

index   : RangeIndex(start=0, stop=3, step=1)
columns : Index(['이름', '가격', '재고'], dtype='object')
values : [['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
dtypes : 이름    object
가격     int64
재고     int64
dtype: object
ndim : 2
shape : (3, 3)

(1-04) 이름과 재고 데이터를 추출하세요.

In [5]:
df[['이름', '재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

(1-05) 비비빅의 가격과 재고 데이터를 추출 하세요.

In [6]:
df.iloc[1]

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object

(1-06) 메로나와 죠스바의 가격, 재고 데이터를 추출하세요.

In [7]:
df.iloc[[0,2]]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

(1-07) 행 인덱스를 '일', '이', '삼'으로 변경해 주세요.

In [8]:
df.index = ['일', '이', '삼']
df

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

(1-08) 총가격 컬럼을 추가 후 0으로 값을 채워주세요.

In [9]:
df['총가격'] = 0
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

(1-09) '빵빠레', 550원, 10개 데이터를 추가해 주세요.

In [10]:
df.loc['사'] = ['빵빠레', 550, 10, 0]
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

(1-10) 비비빅의 재고를 23로 변경해 주세요.

In [11]:
df.iloc[1, 2] = 23
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

2. OHLC(Open/High/Low/Close) 가격정보 데이터입니다.

In [12]:
data = [[ 2000, 3050, 2050, 1980],
        [ 7500, 2050, 2050, 1980],
        [15450, 15050, 15550, 14900]]

(2-01) 데이터를 저장해 주세요

In [13]:
df2 = pd.DataFrame(data, columns = ['시가', '고가', '저가', '종가'])
df2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

(2-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.

In [14]:
# 주요 속성 6개
print(f'index   : {df2.index}')
print(f'columns : {df2.columns}')
print(f'values : {df2.values}')
print(f'dtypes : {df2.dtypes}')
print(f'ndim : {df2.ndim}')
print(f'shape : {df2.shape}')

index   : RangeIndex(start=0, stop=3, step=1)
columns : Index(['시가', '고가', '저가', '종가'], dtype='object')
values : [[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]
dtypes : 시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
ndim : 2
shape : (3, 4)

(2-03) 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01로 변경

In [15]:
df2.index = ['2024-01-01', '2024-02-01', '2024-03-01']
df2

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

(2-04) 행 인덱스를 Open/High/Low/Close로 변경해 주세요

In [16]:
df2.columns = ['Open', 'High' , 'Low' , 'Close']
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

(2-05) 2024-02-01의 High, Close 데이터를 추출 하세요.

In [17]:
df2.iloc[1, [1, 3]]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

(2-06) 2024-04-01의 3200, 3550, 3000, 2990 데이터를 추가해 주세요.

In [18]:
df2.loc['2024-04-01'] = [3200, 3550, 3000, 2990]
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

(2-07) 2024-01-01 데이터를 삭제해 주세요.

In [19]:
df3 = df2.drop(index = '2024-01-01')
df3

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

(2-08) 2024-03-01의 Low값을 14000으로 변경해 주세요.

In [20]:
df3.iloc[2, 2] = 14000
df3

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550  14000   2990

(2-09) Average 컬럼을 추가 후 0으로 값을 채워 주세요.

In [21]:
df3['Average'] = 0
df3

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  15550  14900        0
2024-04-01   3200   3550  14000   2990        0

In [22]:
df3.loc['total'] = 0
df3

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  15550  14900        0
2024-04-01   3200   3550  14000   2990        0
total           0      0      0      0        0

3. 아래 단답형 문제에 답해주세요.

(3-01) 데이터

(3-02) 데이터 프레임

(3-03) 시리즈

(3-04) 데이터 프레임

(3-05) 배열(Array)

(3-06) 시리즈

(3-07) 시리즈

(3-08) 데이터 프레임